Repository: razzeee/konbucase
Catalog: po/extra/*.po
Languages: it, ja, lt, nl, sk, tr

source: Convert case in your text
it: Converti le maiuscole nel tuo testo
ja: テキストの記法を変換します
lt: Keisti atvejį tekste
nl: Zet tekst met verschillende lettergroottes om naar normale tekst
sk: Upravte veľkosti jednotlivých písmen v texte
tr: Metinlerdeki büyük küçük harfleri düzenleyin

source: A small text tool app that allows you convert case in your text.
it: Un piccolo strumento che permette la conversione delle maiuscole nel tuo testo.
ja: テキストの記法を変換できる、小さなテキストツールアプリです。
lt: Minimalus teksto įrankis programėlė leidžianti keisti tarp atvejų tekste.
nl: Zet tekst met verschillende lettergroottes om naar normale tekst.
sk: Malý nástroj na úpravu textu, ktorý vám umožňuje zmeniť jednotlivé písmená v texte na veľké/malé podľa prednastavených možností.
tr: Metninizdeki harflerin düzenini değiştirmenize izin veren küçük bir metin aracı uygulaması.

source: Features include:
it: Funzionalità incluse:
ja: 含まれる機能:
lt: Įtrauktos funkcijos:
nl: Kenmerken:
sk: Funkcie zahŕňajú:
tr: Özellikler:

source: Click "Copy to Clipboard" button to copy the all texts in the text view without selecting them
it: Clicca il pulsante "Copia nella Clipboard" per copiare tutto il testo senza selezionarlo
ja: "クリップボードにコピー" ボタンをクリックすると、テキストビューのテキストを選択せずにコピーできます
lt: Spausti "Išsaugoti į Iškarpinę" mygtuką ir išsaugoti tekstinio vaizdo visus tekstus jų nepasirenkant
nl: Klik op 'Kopiëren naar klembord' om alle tekst te kopiëren zonder deze te kopiëren
sk: Stlačte tlačidlo „Kopírovať do schránky“ na skopírovanie celého textu v zobrazení textu bez predošlého výberu
tr: Metinleri seçmeden tüm metinleri kopyalamak için "Panoya Kopyala" düğmesini tıklayın

source: Convert your text between camelCase, PascalCase, Sentence case, snake_case, kebab-case, and space-separated
it: Converti il tuo testo tra camelCase, PascalCase, Sentence case, snake_case, kebab-case e spazi separati
ja: テキストをキャメルケース、パスカルケース、センテンスケース、スネークケース、ケバブケース、空白区切りのいずれにも変換できます
lt: Tekste keisti tarp camelCase, PascalCase, Sentence case, snake_case, kebab-case, ir space-separated atvejų
nl: Zet tekst met verschillende lettergroottes en opmaken om naar normale tekst, evenals spatiegescheiden tekst
sk: Preveďte váš text medzi camelCase (ťavíText), PascalCase (PascalovýText), Sentence case (Vetný text), snake_case (hadí_text), kebab-case (kebabový-text), and space-separated (oddelený medzerami)
tr: Metninizi camelCase, PascalCase, Tümce düzeni, snake_case, kebab-case ve space-separated arasında dönüştürün

source: App window in the light mode
it: Finestra dell'app in modalità chiara
ja: ライトモードのアプリウィンドウ
nl: Venster met licht thema
sk: Okno aplikácie v svetlom režime
tr: Açık modda uygulama penceresi

source: App window in the dark mode
it: Finestra dell'app in modalità scura
ja: ダークモードのアプリウィンドウ
nl: Venster met donker thema
sk: Okno aplikácie v tmavom režime
tr: Koyu modda uygulama penceresi

source: StyleSwitcher: Let system-synced style preference available on any platforms
sk: Prepínač štýlov: Preferencia systémového štýlu je dostupná na všetkých platformách

source: Update submodules
sk: Aktualizácia submodulov
tr: Alt modülleri güncelle

source: Update translations
it: Traduzioni aggiornate
ja: 翻訳を更新
lt: Atnaujinti vertimus
nl: Vertalingen bijgewerkt
sk: Aktualizované preklady
tr: Çeviriler güncellendi

source: New icon shape (big thanks to @lenemter)
it: Nuova forma dell'icona (grazie mille a @lenemter)
ja: 新しいアイコン (@lenemter に大きな拍手を)
sk: Nový tvar ikonky (veľká vďaka patrí @lenemter)
tr: Yeni simge şekli (@lenemter'e büyük teşekkürler)

source: Improve app metainfo
it: Migliorate metainfo app
ja: アプリのメタ情報を改善
sk: Zlepšenie metainformácií aplikácie
tr: Uygulama üst bilgileri iyileştirildi

source: Update Flatpak runtime version
it: Aggiornata la versione runtime di Flatpak
ja: Flatpak ランタイムのバージョンを更新
lt: Atnaujinti Flatpak vykdomąją versiją
nl: Bijgewerkt: Flatpak-runtimeversie
sk: Aktualizovať verziu Flatpak runtime
tr: Flatpak çalışma zamanı sürümü güncellendi

source: Migrate to GTK 4, the latest version of GTK
it: Migrato a GTK 4, l'ultima versione di GTK
ja: GTK の最新バージョンである、GTK 4 に移行
lt: Keltis į GTK 4, paskiausią GTK versiją
nl: Migratie naar GTK4, de nieuwste GTK-versie
sk: Migrácia na GTK 4, čo je najnovšia verzia GTK
tr: GTK'nın en son sürümü olan GTK 4'e geçiş yapıldı

source: Set kebab-case as a default case for the result view, so that users can understand what they can do with the app more intuitively
it: Imposta kebab-case come caso predefinito per la visualizzazione dei risultati, in modo che gli utenti possano capire cosa possono fare con l'app in modo più intuitivo
ja: ユーザーがアプリの機能をより直感的に理解できるよう、結果画面で使用されるデフォルトのケースをケバブケースに変更
lt: Nustatyti rezultatų rodinio atvejį kaip numatytąjį, kad naudotojai labiau intuityviai susiprotėtų tuo ką jie geba daryti
sk: Nastavenie kebab-case na predvolený formát textu aby používatelia intuitívnejšie pochopili, čo môžu s aplikáciou robiť
tr: Kullanıcıların uygulamayla neler yapabileceklerini daha sezgisel bir şekilde anlayabilmeleri için sonuç görünümü için kebab-case'i varsayılan durum olarak ayarla

source: Fix no style button selected on non-Pantheon desktop environments when first launch
it: Non corretto il pulsante di stile selezionato su ambienti desktop non Pantheon al primo avvio
ja: Pantheon デスクトップ環境以外での初回起動時、どのスタイルボタンも選択されていない不具合を修正
lt: Taisyti be stiliaus esančio mygtuko parinktį kuomet pirmą kartą paleidžiama ne Pantheon darbalaukio aplinka
sk: Opraviť tlačidlo bez štýlu vybraté pri prvom spustení v ne-Pantheonových pracovných prostrediach
tr: Pantheon dışındaki masaüstü ortamlarında ilk başlatıldığında seçili biçim düğmesinin olmaması düzeltildi

source: Check desktop environment on runtime
it: Controlla l'ambiente desktop in runtime
ja: 実行時にデスクトップ環境を確認するように修正
lt: Paleisties metu patikrinti darbalaukio aplinką
sk: Zistiť pracovné prostredie pri spustení aplikácie
tr: Çalışma zamanında masaüstü ortamını denetle

source: Translation updates:
it: Aggiornamenti di traduzione:
ja: 翻訳の更新:
lt: Išvertimo naujiniai:
nl: Vertaalupdates:
sk: Aktualizácie prekladov:
tr: Çeviri güncellemeleri:

source: Update Italian translation (thanks to @albanobattistella)
it: Aggiornata traduzione italiana (grazie a @albanobattistella)
ja: イタリア語翻訳を更新 (貢献者: @albanobattistella)
sk: Aktualizovaný preklad do taliančiny (vďaka @albanobattistella)
tr: İtalyanca çeviri güncellendi (@albanobattistella'ya teşekkürler)

source: Focus the source view by default
it: Metti a fuoco la vista di origine per impostazione predefinita
ja: デフォルトで変換元のテキストビューにフォーカスするように修正
lt: Pagal nutylėjimą sukoncentruoti ties išeities kodo rodiniu
sk: Predvolene označovať zobrazenie zdroja
tr: Varsayılan olarak kaynak görünümüne odaklan

source: Redesign the style switcher
it: Ridisegnato il selettore di stile
ja: スタイルスイッチャーのデザインを変更
lt: Perprojektuoti stiliaus jungiklį
sk: Prerobený prepínač štýlov
tr: Stil değiştirici yeniden tasarlandı

source: Update Japanese translation
it: Aggiornata la traduzione giapponese
ja: 日本語翻訳を更新
lt: Atnaujinti japonišką išvertimą
nl: Bijgewerkt: Japanse vertaling
sk: Aktualizácia prekladu do japončiny
tr: Japonca çeviri güncellendi

source: Rounded window corners
it: Angoli delle finestre arrotondati
ja: ウィンドウが角丸になるように修正
lt: Suapvalinti langelio kampai
sk: Zaoblenie rohov okna
tr: Yuvarlatılmış pencere köşeleri

source: Support building without Granite for other distributions
it: Supporta la costruzione senza Granite per altre distribuzioni
ja: ほかのディストリビューションでの使用を考慮し、Granite なしでもビルドできるように修正
lt: Likusioms platinamosioms programoms užtikrinti vyksmą be Granite
sk: Podpora kompilácie bez Granite pre ostatné distribúcie
tr: Diğer dağıtımlar için Granit olmadan inşa desteği

source: Add Lithuanian translation (thanks to @PolPolyLingo)
it: Aggiunta la traduzione in lituano (grazie a @PolPolyLingo)
ja: リトアニア語翻訳を追加 (貢献者: @PolPolyLingo)
sk: Pridaný preklad do litovčiny (vďaka @PolPolyLingo)
tr: Litvanca çeviri eklendi (@PolPolyLingo'ya teşekkürler)

source: Fix building fails in Flatpak
it: Risolto il problema con la costruzione in Flatpak
ja: Flatpak でビルドに失敗する不具合を修正
lt: Sutaisytas nesėkmingas Flatpak darinio kūrimas
sk: Opravené problémy s kompiláciou Flatpak verzie
tr: Flatpak'ta inşa hataları düzeltildi

source: Publish the app to the new AppCenter on elementary OS 6 with the Flatpak manifest
it: Pubblicato l'app nel nuovo AppCenter su elementary OS 6 con il manifesto Flatpak
ja: Flatpak マニフェストを追加し、アプリを elementary OS 6 の新しい AppCenter にリリース
lt: Publikuoti programėlę naujajame elementary OS 6 AppCenter pagal Flatpak manifest taisykles
sk: Uverejnenie aplikácie do nového AppCentra na elementary OS 6 s Flatpak manifestom
tr: Uygulama Flatpak manifestosuyla elementary OS 6'daki yeni AppCenter'da yayınlandı

source: Update Dutch translation (thanks to @Vistaus)
it: Aggiornata la traduzione in olandese (grazie a @Vistaus)
ja: ドイツ語翻訳を更新 (貢献者: @Vistaus)
sk: Aktualizácia prekladu do holandčiny (vďaka @Vistaus)
tr: Hollandaca çeviri güncellendi (@Vistaus'a teşekkürler)

source: Update Italian translation (thanks to @Sav22999)
it: Aggiornata traduzione italiana (grazie a @Sav22999)
ja: イタリア語翻訳を更新 (貢献者: @Sav22999)
sk: Aktualizovaný preklad do taliančiny (vďaka @Sav22999)
tr: İtalyanca çeviri güncellendi (@Sav22999'a teşekkürler)

source: Support Sentence case
it: Supporto in caso di Frase
ja: センテンスケースに対応
lt: Pritaikyti sakinio atvejį
nl: Ondersteuning voor zinnen met hoofdletters
sk: Pridaná podpora Sentence case (Vetného textu)
tr: Cümle düzeni desteği eklendi

source: Add Turkish translation (thanks to @safak45x)
it: Aggiunta la traduzione in turco (grazie a @safak45x)
ja: トルコ語翻訳を追加 (貢献者: @safak45x)
nl: Turkse vertaling (met dank aan @safak45x)
sk: Pridaný preklad do turečtiny (vďaka @safak45x)
tr: Türkçe çeviri eklendi (@safak45x'e teşekkürler)

source: Clean code
it: Pulizia di codice
ja: コードの整理
lt: Tvarkingas išeities kodas
nl: Code opgeruimd
sk: Upratanie kódu
tr: Temiz kod

source: Separate the core part as an independent library
it: Separata la parte principale come una libreria indipendente
ja: アプリの中心部分を独立したライブラリとして分離
lt: Išskirti vidinį pagrindą kaip nepriklausomą biblioteką
nl: Kernonderdeel afgetakt naar onafhankelijke bibliotheek
sk: Oddelenie jadra aplikácie na nezávislú knižnicu
tr: Çekirdek bölümü bağımsız bir kitaplık olarak ayırın

source: Rename all occurrence of "target" to "source"
it: Rinomina tutte le occorrenze di "target" in "source"
ja: "target" という単語をすべて "source" に置き換え
lt: Visus "target" atitikmenis pervadinti į "source"
nl: Alle vermeldingen van 'doel' hernoemd naar 'bron'
sk: Premenované všetky výskyty slov „target“ na „source“
tr: Tüm "target" oluşumunu "source" olarak yeniden adlandırın

source: Fix changing result case sometimes doesn't take effect
it: Correzione della modifica delle maiuscole nei risultati che a volte non aveva effetto
ja: 変換先のケースの種類を変更しても反映されない場合がある不具合を修正
lt: Sutaisytas funkcionalumas kuomet keičiamas rezultato atvejis tam tikru atveju nesuveikdavo
nl: Opgelost: aanpassen van resultaat werkte soms niet
sk: Oprava stavu, keď sa zmena veľkosti výsledného textu niekedy neaplikuje
tr: Değişen sonuç durumu bazen etkili olmaması düzeltidi

source: Quit the app with Ctrl+Q
it: Esci dall'app con Ctrl+Q
ja: アプリを Ctrl+Q キーで終了できるように修正
lt: Programėlės išjungimui naudoti Ctrl+Q
nl: Sluit af met Ctrl + Q
sk: Ukončenie aplikácie pomocou Ctrl+Q
tr: Ctrl+Q ile uygulamadan çıkın

source: Add Dutch translation (thanks to @Vistaus)
it: Aggiunta la traduzione in olandese (grazie a @Vistaus)
ja: ドイツ語翻訳を追加 (貢献者: @Vistaus)
nl: Nederlandse vertaling (met dank aan @Vistaus)
sk: Pridaný preklad do holandčiny (vďaka @Vistaus)
tr: Felemenkçe çeviri eklendi (@Vistaus'a teşekkürler)

source: Add Portuguese translation (thanks to @rottenpants466)
it: Aggiunta traduzione portoghese (grazie a @rottenpants466)
ja: ポルトガル語翻訳を追加 (貢献者: @rottenpants466)
sk: Pridaný preklad do portugalčiny (vďaka @rottenpants466)
tr: Portekizce çeviri eklendi (teşekkürler @rottenpants466)

source: Save changes in the app state on time
it: Salvataggio delle modifiche dell'app in tempo reale
ja: アプリでの変更を即時に保存するように修正
lt: Laiku išsaugoti programėlės būsenų pakyčius
nl: Sla aanpassingen op bepaalde tijden op
sk: Ukladať zmeny v stave aplikácie včas
tr: Uygulama durumundaki değişiklikleri zamanında kaydedin

source: Side-by-side view
it: Vista affiancata
ja: サイドバイサイドビュー
lt: Vaizdas šalia vienas kito
nl: Zij-aan-zijweergave
sk: Zobrazenie vstupu a výstupu vedľa seba
tr: Yan yana görünüm

source: Improve the app icon (big thanks to @Fatih20)
it: Migliorata l'icona dell'app (grazie a @Fatih20)
ja: アプリのアイコンを改善 (@Fatih20 に大きな拍手を)
nl: Pictogram verbeterd (veel dank aan @Fatih20)
sk: Vylepšenie ikonky aplikácie (veľká vďaka @Fatih20)
tr: Uygulama simgesini iyileştirildi (@ Fatih20'ye çok teşekkürler)

source: Fix changing OS-wide dark style preference is not reflected
it: Risolto il problema con la modifica della preferenza di stile scuro a livello di sistema operativo non riflessa
ja: OS レベルのダークスタイルの設定が反映されない不具合を修正
lt: Sutaisytas funkcionalumas kuomet keičiamo plačiojo elementary OS tamsaus stiliaus pirmumas neatsiskleidžia
nl: Opgelost: donker systeemthema werd niet overgenomen
sk: Oprava problému, keď sa zmena globálneho štýlu operačného systému neaplikovala v aplikácii
tr: İşletim sistemi genelinde değişen karanlık stil tercihinin yansıtılmaması düzeltildi

source: Fix the app freezes when trying to input texts in result_combo_entry
it: Risolvi i blocchi dell'app quando si tenta di inserire testi in result_combo_entry
ja: result_combo_entry にテキストを入力しようとするとアプリがフリーズする不具合を修正
lt: Sutaisytas funkcionalumas kuomet programėlė sustingsta kuomet įvedamas tekstas į result_combo_entry
nl: Opgelost: vastlopen na tekstinvoer in result_combo_entry
sk: Opravené zamrznutia aplikácie pri pokuse o vloženie textu do result_combo_entry
tr: Result_combo_entry'de metin girmeye çalışırken uygulamanın donmasını düzetildi

source: Respect an elementary OS-wide dark preference
it: Rispetta una preferenza scura su elementary OS a livello di sistema operativo
ja: elementary OS のダークスタイル設定を反映するように修正
lt: Pagarbiai plačiai pirmumą taikyti elementary OS tamsiam stiliui
nl: Ondersteuning voor elementary OS' donkere thema
sk: Rešpektovať globálnu preferenciu tmavého štýlu v elementary OS
tr: İşletim sistemi genelinde karanlık temaya uygunluk sağlandı

source: Add a description tooltip to each case
it: Aggiunta una descrizione del comando per ciascun caso
ja: 各ケースに説明のためのツールチップを追加
lt: Įtraukti patariamąjį įrankio aprašą kiekvienam atvejui
nl: Beschrijvingshulpballonnen toegevoegd
sk: Pridaný popis ku každému formátu textu v zozname
tr: Her araça bir açıklama ipucu ekleyin

source: Allow setting per-app dark style preference
it: Consenti l'impostazione della preferenza di stile scuro per-app
ja: このアプリ内限定でダークスタイルを設定できる機能を追加
lt: Leisti tamsaus stiliau pirmumą programėlės nustatymuose
sk: Umožnenie zmeny predvoľby tmavého štýlu v aplikácii nezávisle od systémového nastavenia
tr: Uygulama başına koyu stil tercihini ayarlamaya izin verildi

source: Add French translation (thanks to @NathanBnm)
it: Aggiunta la traduzione in francese (grazie a @NathanBnm)
ja: フランス語翻訳を追加 (貢献者: @NathanBnm)
nl: Nieuw: Franse vertaling (met dank aan @NathanBnm)
sk: Pridaný preklad do francúzštiny (vďaka @NathanBnm)
tr: Fransızca çeviri eklendi (teşekkürler @NathanBnm)

source: Add Italian translation (thanks to @mirkobrombin)
it: Aggiunta traduzione italiana (grazie a @mirkobrombin)
ja: イタリア語翻訳を追加 (貢献者: @mirkobrombin)
nl: Italiaanse vertaling (met dank aan @mirkobrombin)
sk: Pridaný preklad do taliančiny (vďaka @mirkobrombin)
tr: İtalyanca çeviri (teşekkürler @mirkobrombin)

source: Add Japanese translation
it: Aggiunta traduzione giapponese
ja: 日本語翻訳を追加
lt: Pridėti Japonų vertimą
nl: Japanse vertaling
sk: Pridaný preklad do japončiny
tr: Japonca çeviri eklendi

source: Update result texts when changing ComboBox selection
it: Aggiornato i testi dei risultati quando modifichi la selezione ComboBox
ja: コンボボックスの選択項目を変更した場合、変換結果のテキストを更新するように修正
lt: Atnaujinti rezultatų tekstus kuomet keičiamas ComboBox pasirinkimas
nl: Resultaatteksten worden bijgewerkt na het aanpassen van selecties in het uitrolmenu
sk: Aktualizovať výsledný text pri zmene formátu v kontextovom menu
tr: ComboBox seçimini değiştirirken sonuç metinleri güncellendi

source: Initial release
it: Versione iniziale
ja: 最初のリリース
lt: Pradinė laida
nl: Eerste versie
sk: Prvé vydanie
tr: İlk sürüm

source: Case Converting App
it: Applicazione per la conversione delle maiuscole
ja: 記法変換アプリ
lt: Konvertavimo atvejų programėlė
nl: Lettergrootte-omzettoepassing
sk: Aplikácia na premenu veľkosti písmen v texte
tr: Metin Dönüştürme Uygulaması

source: Text;
it: Testo;
ja: Text;テキスト;
lt: Tekstas;
nl: Tekst;Grootte;Letter;
tr: Metin;

source: KonbuCase
lt: KonveCase
